Repository: lechixy/LechYTDLP
Catalog: LechYTDLP/Strings/*/Resources.resw
Source language: en_us
Languages: tr_tr

# DownloadsC.Content
source: Downloads
tr_tr: İndirilenler

# ExtensionAddedMediaInfoBarMsg
source: {0} extension added media
tr_tr: {0} eklentisi bir medya ekledi

# ExtensionAddedMediaLog
source: {0} extension added media: {1}
tr_tr: {0} eklentisi bir medya ekledi: {1}

# FirstLog
source: ✨ The logs will be appear here, mate <3
tr_tr: ✨ Çıktılar burada gözükecek dostum <3

# LechYTdlpSubtitle.Text
source: ❝Download any video, you like.❞
tr_tr: ❝İstediğin, her videoyu indir.❞

# LogsC.Content
source: Logs
tr_tr: Çıktılar

# MainNav.Content
source: Search
tr_tr: Arama

# OptionsC.Content
source: Options
tr_tr: Seçenekler

# Options.Text
source: Options
tr_tr: Seçenekler

# ThemeChanged
source: Theme changed to {0}
tr_tr: Tema {0} olarak değiştirildi

# BackdropChanged
source: Backdrop changed to {0}
tr_tr: Arayüz arkaplanı {0} olarak değiştirildi

# BackdropChangedFailed
source: Failed to change backdrop, {0} may not be supported on this system.
tr_tr: Arayüz arkaplanı değiştirilemedi,, {0} bu sistemde desteklenmiyor olabilir.

# Settings.Text
source: Settings
tr_tr: Ayarlar

# CustomizeYTDLP.Header
source: Customize YT-DLP
tr_tr: YT-DLP'yi Özelleştir

# CustomizeYTDLP.Description
source: How yt-dlp should treat you?
tr_tr: Sana nasıl davranmalı?

# YTdlpPathSetting.Header
source: YT-DLP path
tr_tr: YT-DLP yolu

# YTdlpPathSetting.Description
source: Path to yt-dlp executable (yt-dlp.exe)
tr_tr: yt-dlp programına yol (yt-dlp.exe)

# FFmpegPathSetting.Header
source: FFmpeg path
tr_tr: FFmpeg yolu

# FFmpegPathSetting.Description
source: Path to FFmpeg executable (ffmpeg.exe)
tr_tr: FFmpeg programına yol (ffmpeg.exe)

# CheckDepends.Description
source: Check your dependencies is working correctly
tr_tr: Bağımlılıklar doğru çalışıyor mu kontrol edin

# CheckDependsButton.Content
source: Check
tr_tr: Bağımlılıkları kontrol et

# JsRuntimeSetting.Header
source: JavaScript runtime
tr_tr: JavaScript çalışma ortamı

# JsRuntimeSetting.Description
source: Additional JavaScript runtime to enable
tr_tr: Ek olarak JavaScript çalışma ortamı

# JsRuntimeSettingCombo.PlaceholderText
source: Select runtime
tr_tr: Çalışma ortamı seçin

# Customization.Text
source: Customization
tr_tr: Özelleştirme

# AppLanguageSetting.Header
source: Language
tr_tr: Dil

# AppLanguageSetting.Description
source: Change app language
tr_tr: Uygulamanın dilini değiştirin

# AppLanguageSettingCombo.PlaceholderText
source: Select language
tr_tr: Dil seçin

# AppThemeSetting.Header
source: Theme
tr_tr: Tema

# AppThemeSetting.Description
source: What should app look like
tr_tr: Uygulama nasıl görünmeli

# AppThemeSettingCombo.PlaceholderText
source: Select theme
tr_tr: Tema seçin

# AppBackdropSetting.Description
source: What should app background look like (some options not available on every pc)
tr_tr: Uygulamanın arkaplanı nasıl görünmeli (bazı ayarlar her sistemde mevcut olmayabilir)

# AppBackdropSettingCombo.PlaceholderText
source: Select backdrop
tr_tr: Arkaplan yüzeyi seçin

# DeveloperOptions.Text
source: Developer Options
tr_tr: Geliştirici Seçenekleri

# BlobDataSetting.Header
source: Use blob data
tr_tr: Sahte veri kullan

# BlobDataSetting.Description
source: You can use blob data for testing, fill Desktop\a.json with yt-dlp --dump-json data
tr_tr: Test etmek için sahte veri kullabilirsiniz, Masaüstü\a.json dosyasını yt-dlp --dump-json verisi ile doldurun

# WriteVideoInfoSetting.Header
source: Write video info
tr_tr: Video verisini yaz

# WriteVideoInfoSetting.Description
source: Write yt-dlp --dump-json data to Desktop\b.json
tr_tr: yt-dlp --dump-json verisini Masaüstü\b.json dosyasına yaz

# About.Text
source: About
tr_tr: Hakkında

# GithubLink.Content
source: Source code - GitHub
tr_tr: Kaynak kodu - GitHub

source: Version
tr_tr: Versiyon

# MadeBy
source: 🤍 Made by @lechixy
tr_tr: 🤍 @lechixy tarafından yapıldı

# AppBackdropSetting.Header
source: Backdrop
tr_tr: Arkaplan yüzeyi

# ApplicationStatusCheck
source: Checking YT-DLP and FFmpeg versions...
tr_tr: YT-DLP ve FFmpeg versiyonları kontrol ediliyor...

# ApplicationStatusCheckCheckingFFmpeg
source: Checking FFmpeg version...
tr_tr: FFmpeg versiyonu kontrol ediliyor...

# ApplicationStatusCheckNotWorking
source: is not working, check executable path.
tr_tr: çalışmıyor, uygulamanın yolunu kontrol edin.

source: None
tr_tr: Hiçbiri

source: System
tr_tr: Sistem

source: Light
tr_tr: Aydınlık

source: Dark
tr_tr: Karanlık

source: Acrylic
tr_tr: Akrilik

# LanguageChangedInfoBarMsg
source: Language has been changed to {0}
tr_tr: Dil {0} olarak değiştirildi

# File.Text
source: File
tr_tr: Dosya

# FilenameSettings.Header
source: Filename Template
tr_tr: Dosya ismi şablonu

# FilenameHyperLink.Content
source: YT-DLP output template examples
tr_tr: YT-DLP çıktı şablonu örnekleri

# FilenameTextBox.PlaceholderText
source: Define filename template
tr_tr: Dosya ismi şablonu belirle

# SaveToSetting.Header
source: Save directory
tr_tr: Kaydetme klasörü

# SaveToSetting.Description
source: Which directory should your downloaded media save
tr_tr: İndirilen medya hangi dizine kaydedilmeli

# SaveToTextBox.PlaceholderText
source: Define directory
tr_tr: Dizin belirle

# EmbedThumbnailSetting.Header
source: Embed thumbnail
tr_tr: Küçük resmi ekle

# EmbedThumbnailSetting.Description
source: Embed thumbnail in the media as the cover art
tr_tr: Medyanın küçük resmini poster resmi olarak ekle

# EmbedSubsSetting.Header
source: Embed subtitles
tr_tr: Altyazıları ekle

# EmbedSubsSetting.Description
source: Embed subtitles in the media (only valid: mp4, webm and mkv)
tr_tr: Medyadaki altyazıları ekle (sadece bunlarda geçerli: mp4, webm ve mkv)

# Account.Text
source: Account
tr_tr: Hesap

# CookiesSetting.Header
source: Cookies file
tr_tr: Çerezler dosyası

# CookiesFileHyperLink.Content
source: Hey! Why I need to pass my cookies to here? See here.
tr_tr: Hey! Neden çerezlerimi buraya koymam gerekiyor? Burda görün.

# CookiesFileTextBox.PlaceholderText
source: Path to cookie file (.txt)
tr_tr: Çerezler dosyasının dizini (.txt)

# Logs.Text
source: Logs
tr_tr: Çıktılar

# Copy.Text
source: Copy
tr_tr: Kopyala

# Downloads.Text
source: Downloads
tr_tr: İndirilenler

# NoQueue.Text
source: There is no downloads on queue, hop to search to gather some videos
tr_tr: Sırada hiç indirme yok, biraz video eklemek için aramaya göz at

# InQueue.Text
source: In queue
tr_tr: Sıradakiler

# History.Text
source: History
tr_tr: Geçmiş

# Clear.Content
source: Clear
tr_tr: Temizle

# DownloadAgain.Text
source: Download again
tr_tr: Tekrar indir

# OpenInExplorer.Text
source: Open in explorer
tr_tr: Dosya gezgininde aç

# CopyTitle.Text
source: Copy title
tr_tr: Başlığı kopyala

# CopyLink.Text
source: Copy link
tr_tr: Bağlantıyı kopyala

# CopyFilePath.Text
source: Copy file path
tr_tr: Dosya yolunu kopyala

# Delete.Text
source: Delete
tr_tr: Sil

source: Unknown title
tr_tr: Bilinmeyen başlık

source: Unknown uploader
tr_tr: Bilinmeyen yükleyici

# SavingTo
source: Saving to {0}
tr_tr: Kaydediliyor: {0}

source: Download failed
tr_tr: İndirme başarısız oldu

source: File can't be opened
tr_tr: Dosya açılamadı

# FileCantBeOpenedMsg
source: Check the file, it may have been moved, renamed or deleted
tr_tr: Dosyayı kontrol edin, taşınmış, yeniden adlandırılmış veya silinmiş olabilir

# NoYTdlpExecutable
source: There is no yt-dlp.exe
tr_tr: yt-dlp.exe bulunamadı

# NoFFmpegExecutable
source: There is no ffmpeg.exe
tr_tr: ffmpeg.exe bulunamadı

# NoYTdlpExecutableLog
source: There is no yt-dlp.exe! Check the settings because we can't find any executable. Details: {0}
tr_tr: yt-dlp.exe bulunamadı! Ayarları kontrol edin çünkü biz bir çalıştırılabilir bulamadık. Detaylar: {0}

source: ERROR
tr_tr: HATA

# NoYTdlpExecutableMsg
source: Check yt-dlp path from Settings because we can't find any executable
tr_tr: yt-dlp'nin yolunu Ayarlar'dan kontrol edin çünkü biz bir çalıştırılabilir bulamadık

# NoFFmpegExecutableMsg
source: Check FFmpeg path from Settings because we can't find any executable
tr_tr: FFmpeg'nin yolunu Ayarlar'dan kontrol edin çünkü biz bir çalıştırılabilir bulamadık

# NoFFmpegExecutableLog
source: There is no ffmpeg.exe! Check the Settings because we can't find any executable. Details: {0}
tr_tr: ffmpeg.exe bulunamadı! Ayarları kontrol edin çünkü biz bir çalıştırılabilir bulamadık. Detaylar: {0}

source: Invalid link
tr_tr: Geçersiz bağlantı

# InvalidLinkMsg
source: The provided link is invalid. Please check and try again.
tr_tr: Girilen bağlantı geçersiz. Lütfen kontrol edin ve tekrar deneyin.

# InvalidLinkLog
source: The provided link is invalid. Details: {0}
tr_tr: Girilen bağlantı geçersiz. Detaylar: {0}

source: Unhandled error
tr_tr: Tanımlanmamış hata

source: Copied to clipboard
tr_tr: Panoya kopyalandı

source: Deleted from history
tr_tr: Geçmişten silindi

source: Delete failed
tr_tr: Silme başarız oldu

# SavedTo
source: Saved to {0}
tr_tr: Kaydedildi: {0}

# BrowserExtWontWork
source: Browser extension will not work • Failed to start Browser Extension HTTP listener: {0}
tr_tr: Tarayıcı Eklentisi çalışmayacak • Tarayıcı Eklentisinin HTTP dinleyicisi başlatılamadı: {0}

# StartingYTdlpWithLog
source: Starting YT-DLP with
tr_tr: YT-DLP bununla başlatılıyor

# GettingVideoInfoLog
source: Getting video info
tr_tr: Video bilgisi alınıyor

# DownloadingVideoLog
source: Downloading video
tr_tr: Video indiriliyor

source: Don't include video
tr_tr: Videoyu dahil etme

source: Don't include audio
tr_tr: Sesi dahil etme

source: No codec info
tr_tr: Kodlayıcı bilgisi yok

# SelectedVideoLog
source: Selected video formatId-codec
tr_tr: Seçilen video format numarası-kodlayıcısı

# SelectedAudioLog
source: Selected audio formatId-codec
tr_tr: Seçilen ses format numarası-kodlayıcısı

# OnlyOneCodec
source: Only one codec available
tr_tr: Sadece bir kodlayıcı

source: Not suggested
tr_tr: Önerilmez

source: Saving
tr_tr: Kaydediliyor

source: Select format
tr_tr: Format seçin

source: Save
tr_tr: Kaydet

source: Cancel
tr_tr: İptal

# Resolution.Header
source: Resolution
tr_tr: Çözünürlük

# Codec.Header
source: Codec
tr_tr: Kodlayıcı

# Audio.Header
source: Audio
tr_tr: Ses

# SuggestAVC1
source: Most compatible • Larger file size
tr_tr: En uyumlu • Yüksek dosya boyutu

# SuggestVP9
source: Moderately compatible • Medium file size
tr_tr: Orta uyumlu • Normal dosya boyutu

# SuggestAV1
source: Less compatible • Smaller file size
tr_tr: Az uyumlu • Düşük dosya boyutu

source: Unknown
tr_tr: Bilinmeyen

source: Unknown filesize
tr_tr: Bilinmeyen dosya boyutu

# Placeholder0
source: Paste video link here...
tr_tr: Video bağlantısını buraya yapıştır...

# Placeholder1
source: Try me Beyonce... ✨
tr_tr: Dene beni Beyonce... ✨

# Placeholder2
source: I want to download that cute cat video...
tr_tr: O tatlı kedi videosunu indirmek istiyorum...

# Placeholder3
source: I bet you have some cool videos to download...
tr_tr: Bahse girerim indireceğin havalı videolar vardır...

# Placeholder4
source: Don't be shy, paste a link...
tr_tr: Utanma, bağlantı yapıştır...

# Placeholder5
source: Your video link goes here...
tr_tr: Video bağlantın buraya gidiyor...

# Placeholder6
source: Got a video in mind? Paste it here...
tr_tr: Aklında video mu var? Buraya yapıştır...

# Placeholder7
source: Ready to download? Paste the link...
tr_tr: İndirmeye hazır mısın? Bağlantıyı yapıştır...

# Placeholder8
source: I can download videos from over 1000 sites...
tr_tr: 1000'den fazla siteden video indirebiliyorum...

# Placeholder9
source: Looking for something?..
tr_tr: Bir şey mi arıyordun?..
